posts/bayesian-fallacies-part-3-putting-it-all-together.org
#+BEGIN_COMMENT
.. title: Bayesian Fallacies, Part 3: Putting It All Together
.. slug: bayesian-fallacies-part-3-putting-it-all-together
.. date: 2019-10-28 13:15:10 UTC-04:00
.. tags: math, dataviz
.. category: bayesian-fallacies
.. link: 
.. description: Putting the Bayesian stats all together
.. type: text
.. has_math: true
.. status: draft
#+END_COMMENT
Last time, we did a thorough mathematical analysis of our running PSAT test score problem, and got
some sense of why it doesn't exhibit a strong regression to the mean effect. This time, we'll
generalize the problem completely and examine it in other contexts. We'll bookend it by connecting
it to Bayes' paradox, something I promised in the first post but haven't done yet.

{{{TEASER_END}}}

