posts/bayesian-fallacies-part-3-putting-it-all-together/index.html
<!DOCTYPE html>
<html prefix="
" lang="en">
<head>
<meta charset="utf-8">
<meta name="description" content="Putting the Bayesian stats all together">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<title>Pollard's Rho · Bayesian Fallacies, Part 3: Putting It All Together </title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<!-- Global site tag (gtag.js) - Google Analytics --><meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="https://nicholas-miklaucic.github.io/posts/bayesian-fallacies-part-3-putting-it-all-together/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Nicholas Miklaucic">
<meta name="robots" content="noindex">
</head>
<body class="">
    <a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

    <div class="hsidebar">
        <div class="container sidebar-sticky">
            <div class="sidebar-about">
              <h1>
                <a href="https://nicholas-miklaucic.github.io/">
                      <h1 id="brand"><a class="no-tufte-underline" href="https://nicholas-miklaucic.github.io/" title="Pollard's Rho" rel="home">

        <span id="blog-title">Pollard&#8217;s&nbsp;Rho</span>
    </a></h1>

                </a>
              </h1>
                <p class="lead">Thoughts on math, computing, and&nbsp;data</p>

            </div>
                <nav id="menu" role="navigation" class="sidebar-nav"><a class="no-tufte-underline sidebar-nav-item" href="../../pages/about-me/">About Me</a>
        <a class="no-tufte-underline sidebar-nav-item" href="../../archive.html">Archive</a>
        <a class="no-tufte-underline sidebar-nav-item" href="../../categories/">Tags</a>
        <a class="no-tufte-underline sidebar-nav-item" href="../../rss.xml"><span class="caps">RSS</span> feed</a>
    
    
    </nav><footer id="footer"><span class="copyright">
              Contents © 2021         <a href="mailto:nicholas.miklaucic@gmail.com">Nicholas Miklaucic</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            </span>
            
            
        </footer>
</div>
    </div>

    <div class="content container" id="content">
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><h1 class="post-title p-name"><a href="." class="u-url">Bayesian Fallacies, Part 3: Putting It All&nbsp;Together</a></h1>

    <span class="post-date">
      <time class="published dt-published" datetime="2019-10-28T13:15:10-04:00" itemprop="datePublished" title="2019-10-28 13:15">2019-10-28 13:15</time></span>
        <meta name="description" itemprop="description" content="Putting the Bayesian stats all together">
<div class="e-content entry-content" itemprop="articleBody text">
    <p>
Last time, we did a thorough mathematical analysis of our running <span class="caps">PSAT</span> test score problem, and got
some sense of why it doesn&#8217;t exhibit a strong regression to the mean effect. This time, we&#8217;ll
generalize the problem completely and examine it in other contexts. We&#8217;ll bookend it by connecting
it to Bayes&#8217; paradox, something I promised in the first post but haven&#8217;t done&nbsp;yet.
</p>

<!-- TEASER_END -->
