posts/bayesian-fallacies-part-3-putting-it-all-together.org
* Dimensional Analysis and Reframing
Let's zoom out. How can we frame this problem in a way that lets us apply this math to any example
of the effect? In particular, consider $P(A|B)$ as a function of $M, S, \sigma$, and $t$. What can
we say about this complicated function? 

What if I told you that a powerful technique to attack problems like was introduced to me in a fluid
mechanics class, not in math or statistics? We're going to steal an elegant approach from physics:
/dimensional analysis/, a way of reasoning about systems or models in a way that can be generalized.

{{{mn}}}
This is a large subject, and my rudimentary fluid mechanics background is not enough for me to delve
too much deeper into this rabbit-hole. Basically, it's a cool idea. The application we're going to
be dealing with is a particularly easy version, so it won't be nearly as difficult as working with
the Reynolds number or the Buckingham $\pi$ theorem or something crazy.
{{{mn-end}}}

Basically, any property of a model or system that's dimensionless must therefore be comparable
across different realizations of that model or system. Thus, combining parameters with a dimension
into a dimensionless form is a powerful way of abstracting problems. A classic example is the period
of oscillation of a mass attached to a spring: given the mass $M$, the restoring force constant $k$,
the period $T$, and gravity acceleration $g$, there is only one combination of these that give a
dimensionless constant, $T^2 km^-1$. Note that $g$ doesn't appear here. This means that, without
knowing any laws of physics besides the units of all of these parameters, we can conclude that the
period of a spring doesn't depend on the gravity of its environment!

This is an incredibly powerful technique, and fantastically useful for making models. If you want to
simulate the water around a cruise ship in your bathub, matching the dimensionless quantities
involved will make sure your liquid behaves the exact same way, even though all of the dimensional
quantities may be completely different.

You might object that we haven't been /using/ any dimensions. How can we cancel dimensions that don't
exist? 

My answer is that they've been there the whole time: I just haven't been talking about them! PSAT
points /is/ a dimension of this problem, with all of the rules that mass or length have: we'll use $p$
as a shorthand to mirror $m$ or $s$ or $^\circ C$ in physics. The reason I haven't needed to talk
about it is because all of these parameters have the same dimension: $p$. This means that we can
combined them and never need to worry about creating formulas that don't work
dimensionally. However, it will guide us in abstracting this problem now. How can we mess around
with our /parameter space/ to make the problem easier to generalize outside of PSAT points?

First things first: $M$ doesn't really count as a parameter because it doesn't affect
$P(A|B)$. We'll just assume it's $0$ in the future: we can always just subtract it from every piece
of data to make that true.

{{{mn}}}
You might wonder how I know that we need $3 - 1 = 2$ dimensionless quantities. This is actually the
celebrated Buckingham \pi theorem at work: check the link to learn more about it. Those of you with
some abstract algebra or linear algebra might see the deeper connections to those fields.
{{{mn-end}}}

There are many ways we could combine the remaining quantities to make dimensionless expressions. We
have three parameters, which will give us two expressions because we have one type of
dimension. First things first: how can we modify $t$ so it's more comparable across problems?
Similar to how we defined $t$ as a 1% cutoff instead of a particular score early on, we can use a
similar idea here: let $t'$ be the /number of standard deviations/ the threshold is away from
$M$. Here, the standard deviation we're using is the standard deviation of the test scores or their
equivalents, which is $\sqrt{S^2 + \sigma^2}$. This has units $p$, so if we let $t' =
\frac{t}{\sqrt{S^2 + \sigma^2}}$ we'll have a dimensionless quantity. Let's call this the
/z-threshold/, because it's a z-score of the threshold. We'll change the name from $t'$ to $z$ to
reflect this.

What does this quantity represent in the system, qualitatively? It's pretty simple: higher values
indicate that $P(B)$ is smaller and thus that fewer people pass the initial cutoff or the second
cutoff. (Note that $P(B)$ is a simple function of $z$: dimensional analysis makes it easy to reason
about what parameters a function will use, because $P(B)$ is itself dimensionless so it needs to
only take dimensionless arguments.)

Now we want one more constant. We've already captured the information $t$ had to offer, so we'll
limit ourselves to $\sigma$ and $S$. Now, there's really nothing to do but simply create a ratio:
the quantity $\frac{\sigma}{S}$ is a dimensionless constant. This one's really important, so we're
going to name this quantity as well. We'll call it the /regression-selection ratio/, which I'll denote
$\rho$. 

What does this ratio represent? The name gives it away: it's a ratio that characterizes the strength
of the regression effect with the strength of the selection effect. Higher values of $\rho$ indicate
that the variability /within/ individuals is high compared to the variation /across/ individuals. This
creates a stronger /regression effect/: intuitively, luck matters more, so the inherent tendency of
luck to even outlier hurts you more. The reverse scenario, a low $\rho$, creates a scenario with a
strong selection effect: luck has little to do with passing the cutoff, so even if it abandons you
things are still looking good.

{{{mn}}}
You might be worried that the math we did last time didn't explicitly use these variables, so we
can't really reuse the same code. It actually works out because we can easily reverse this process,
going from two dimensionless parameters to four dimensional parameters, as long as we fix $M = 0$
and $S = 1$: then $\sigma = \rho$ and $t = z(\sqrt{\sigma^2 + 1^2})$. We can then just use the same
formulas we were using earlier.
{{{mn-end}}}

To recap: by the principles of dimensional analysis, $P(A|B)$ varies /only/ as a function of $z$ and
$\rho$: nothing else matters. This means we can compare problems with our PSAT example without
redoing any math: just plug the new values in and we're good to go!

