posts/bayesian-fallacies-part-3-putting-it-all-together/index.html

<div id="outline-container-org67218a7" class="outline-2">
<h2 id="org67218a7">Dimensional Analysis and&nbsp;Reframing</h2>
<div class="outline-text-2" id="text-org67218a7">
<p>
Let&#8217;s zoom out. How can we frame this problem in a way that lets us apply this math to any example
of the effect? In particular, consider \(P(A|B)\) as a function of \(M, S, \sigma\), and \(t\). What can
we say about this complicated&nbsp;function? 
</p>

<p>
What if I told you that a powerful technique to attack problems like was introduced to me in a fluid
mechanics class, not in math or statistics? We&#8217;re going to steal an elegant approach from physics:
<i>dimensional analysis</i>, a way of reasoning about systems or models in a way that can be&nbsp;generalized.
</p>

<span class="marginnote"><p>
</p>
<p>
This is a large subject, and my rudimentary fluid mechanics background is not enough for me to delve
too much deeper into this rabbit hole. Basically, it&#8217;s a cool idea. The application we&#8217;re going to
be dealing with is a particularly easy version, so it won&#8217;t be nearly as difficult as working with
the Reynolds number or the Buckingham \(\pi\) theorem or something&nbsp;crazy.
</p>
</span>

<p>
Basically, any property of a model or system that&#8217;s dimensionless must be comparable across
different realizations of that model or system. Thus, combining parameters with a dimension into a
dimensionless form is a powerful way of abstracting problems. A classic example is the period of
oscillation of a mass attached to a spring: given the mass \(M\), the restoring force constant \(k\),
the period \(T\), and gravity acceleration \(g\), there is only one combination of these that give a
dimensionless constant, \(T^2 km^-1\). Note that \(g\) doesn&#8217;t appear here. This means that, without
knowing any laws of physics besides the units of all of these parameters, we can conclude that the
period of a spring doesn&#8217;t depend on the gravity of its&nbsp;environment!
</p>

<p>
This is an incredibly powerful technique, and fantastically useful for making models. If you want to
simulate the water around a cruise ship in your bathub, matching the dimensionless quantities
involved will make sure your liquid behaves the exact same way, even though all of the dimensional
quantities may be completely&nbsp;different.
</p>

<p>
You might object that we haven&#8217;t been <i>using</i> any dimensions. How can we cancel dimensions that don&#8217;t&nbsp;exist? 
</p>

<p>
My answer is that they&#8217;ve been there the whole time: I just haven&#8217;t been talking about them! <span class="caps">PSAT</span>
points <i>is</i> a dimension of this problem, with all of the rules that mass or length have: we&#8217;ll use \(p\)
as a shorthand to mirror \(m\) or \(s\) or \(^\circ C\) in physics. The reason I haven&#8217;t needed to talk
about it is because all of these parameters have the same dimension: \(p\). This means that we can
combined them and never need to worry about creating formulas that don&#8217;t work
dimensionally. However, it will guide us in abstracting this problem now. How can we mess around
with our <i>parameter space</i> to make the problem easier to generalize outside of <span class="caps">PSAT</span>&nbsp;points?
</p>

<p>
First things first: \(M\) doesn&#8217;t really count as a parameter because it doesn&#8217;t affect
\(P(A|B)\). We&#8217;ll just assume it&#8217;s \(0\) in the future: we can always just subtract it from every piece
of data to make that&nbsp;true.
</p>

<span class="marginnote"><p>
</p>
<p>
You might wonder how I know that we need \(3 - 1 = 2\) dimensionless quantities. This is actually the
celebrated Buckingham π theorem at work: check the link to learn more about it. Those of you with
some abstract algebra or linear algebra might see the deeper connections to those&nbsp;fields.
</p>
</span>

<p>
There are many ways we could combine the remaining quantities to make dimensionless expressions. We
have three parameters, which will give us two expressions because we have one type of
dimension. First things first: how can we modify \(t\) so it&#8217;s more comparable across problems?
Similar to how we defined \(t\) as a 1% cutoff instead of a particular score early on, we can use a
similar idea here: let \(t&#8217;\) be the <i>number of standard deviations</i> the threshold is away from
\(M\). Here, the standard deviation we&#8217;re using is the standard deviation of the test scores or their
equivalents, which is \(\sqrt{S^2 + \sigma^2}\). This has units \(p\), so if we let \(t&#8217; =
\frac{t}{\sqrt{S^2 + \sigma^2}}\) we&#8217;ll have a dimensionless quantity. Let&#8217;s call this the
<i>z-threshold</i>, because it&#8217;s a z-score of the threshold. We&#8217;ll change the name from \(t&#8217;\) to \(z\) to
reflect&nbsp;this.
</p>

<p>
What does this quantity represent in the system, qualitatively? It&#8217;s pretty simple: higher values
indicate that \(P(B)\) is smaller and thus that fewer people pass the initial cutoff or the second
cutoff. (Note that \(P(B)\) is a simple function of \(z\): dimensional analysis makes it easy to reason
about what parameters a function will use, because \(P(B)\) is itself dimensionless so it needs to
only take dimensionless&nbsp;arguments.)
</p>

<p>
Now we want one more constant. We&#8217;ve already captured the information \(t\) had to offer, so we&#8217;ll
limit ourselves to \(\sigma\) and \(S\). Now, there&#8217;s really nothing to do but simply create a ratio:
the quantity \(\frac{\sigma}{S}\) is a dimensionless constant. This one&#8217;s really important, so we&#8217;re
going to name this quantity as well. We&#8217;ll call it the <i>regression-selection ratio</i>, which I&#8217;ll denote&nbsp;\(\rho\). 
</p>

<p>
What does this ratio represent? The name gives it away: it&#8217;s a ratio that characterizes the strength
of the regression effect with the strength of the selection effect. Higher values of \(\rho\) indicate
that the variability <i>within</i> individuals is high compared to the variation <i>across</i> individuals. This
creates a stronger <i>regression effect</i>: intuitively, luck matters more, so the inherent tendency of
luck to even outlier hurts you more. The reverse scenario, a low \(\rho\), creates a scenario with a
strong selection effect: luck has little to do with passing the cutoff, so even if it abandons you
things are still looking&nbsp;good.
</p>

<span class="marginnote"><p>
</p>
<p>
You might be worried that the math we did last time didn&#8217;t explicitly use these variables, so we
can&#8217;t really reuse the same code. It actually works out because we can easily reverse this process,
going from two dimensionless parameters to four dimensional parameters, as long as we fix \(M = 0\)
and \(S = 1\): then \(\sigma = \rho\) and \(t = z(\sqrt{\sigma^2 + 1^2})\). We can then just use the same
formulas we were using&nbsp;earlier.
</p>
</span>

<p>
To recap: by the principles of dimensional analysis, \(P(A|B)\) varies <i>only</i> as a function of \(z\) and
\(\rho\): nothing else matters. This means we can compare problems with our <span class="caps">PSAT</span> example without
redoing any math: just plug the new values in and we&#8217;re good to&nbsp;go!
</p>
</div>
</div>
