posts/bayesian-fallacies-part-3-putting-it-all-together.org
* $z$ and $\rho$ In Context
We want to get an intuitive sense of how $z$ and $\rho$ affect $P(A|B)$ so we can intuit how
different systems exhibit regression to the mean. First things first: what are the values of $z$ and
$\rho$ for our PSAT running example?

The math is pretty easy: $z = \frac{1460 - 1014}{197} \approx 2.25$, and $\rho = \frac{20}{197}
\approx 0.1015$. The value of $P(A|B)$ for this iteration of the problem is about 85%, and so it's
around that for any version of the problem with these parameters.

{{{mn}}}
Note that the actual function $P(A|B)$ of $z$ and $\rho$, if you wrote it out, would be a horrific
mess of integrals and the normal CDF. This is normal for dimensional analysis: it's nice when the
value you care about is a nice function of your dimensionless quantities, but that isn't always
so. The importance of this technique is that, so long as we /can/ compute $P(A|B)$, we can still
reason about different forms of the problem.
{{{mn-end}}}

Now I'll take us quickly through a whirlwind of different examples from different real-world
problems. For each one, I'll explain how I estimated the values of $z$ and $\rho$, and I'll compare
the computed value of $P(A|B)$ with what common sense might conclude.

One thing about the interpretation of this phenomenon: remember when, in the first post, we
simulated that any test-taker who qualifies for National Merit has a 57% chance of doing worse the
next time? That effect—comparing people to their prior selves—is a more general version of
regression to the mean. To borrow the Olympic ski jump example again, if the Norway skiier had a
good first jump they're still likely to have a good second jump, because Norwary Olympic skiiers
tend to be really good, but it's likely to be worse than their first. We're going to focus on
$P(A|B)$ because it's the one we care about for the PSAT example, but note that in the real world we
often are actually talking about this quantity. (The two values correlate with each other in
reverse, so in comparing different scenarios it doesn't matter which one we use: if $P(A|B)$ is
lower in one scenario than in another, the probability of doing worse the second time will be higher
and vice versa.)

** "Sophomore Slump": NBA Rookie Seasons
