posts/bayesian-fallacies-part-3-putting-it-all-together/index.html

<div id="outline-container-orgcd433f5" class="outline-2">
<h2 id="orgcd433f5">\(z\) and \(\rho\) In&nbsp;Context</h2>
<div class="outline-text-2" id="text-orgcd433f5">
<p>
We want to get an intuitive sense of how \(z\) and \(\rho\) affect \(P(A|B)\) so we can intuit how
different systems exhibit regression to the mean. First things first: what are the values of \(z\) and
\(\rho\) for our <span class="caps">PSAT</span> running&nbsp;example?
</p>

<p>
The math is pretty easy: \(z = \frac{1460 - 1014}{197} \approx 2.25\), and \(\rho = \frac{20}{197}
\approx 0.1015\). The value of \(P(A|B)\) for this iteration of the problem is about 85%, and so it&#8217;s
around that for any version of the problem with these&nbsp;parameters.
</p>

<span class="marginnote"><p>
</p>
<p>
Note that the actual function \(P(A|B)\) of \(z\) and \(\rho\), if you wrote it out, would be a horrific
mess of integrals and the normal <span class="caps">CDF</span>. This is normal for dimensional analysis: it&#8217;s nice when the
value you care about is a nice function of your dimensionless quantities, but that isn&#8217;t always
so. The importance of this technique is that, so long as we <i>can</i> compute \(P(A|B)\), we can still
reason about different forms of the&nbsp;problem.
</p>
</span>

<p>
Now I&#8217;ll take us quickly through a whirlwind of different examples from different real-world
problems. For each one, I&#8217;ll explain how I estimated the values of \(z\) and \(\rho\), and I&#8217;ll compare
the computed value of \(P(A|B)\) with what common sense might&nbsp;conclude.
</p>

<p>
One thing about the interpretation of this phenomenon: remember when, in the first post, we
simulated that any test-taker who qualifies for National Merit has a 57% chance of doing worse the
next time? That effect—comparing people to their prior selves—is a more general version of
regression to the mean. To borrow the Olympic ski jump example again, if the Norway skiier had a
good first jump they&#8217;re still likely to have a good second jump, because Norwary Olympic skiiers
tend to be really good, but it&#8217;s likely to be worse than their first. We&#8217;re going to focus on
\(P(A|B)\) because it&#8217;s the one we care about for the <span class="caps">PSAT</span> example, but note that in the real world we
often are actually talking about this quantity. (The two values correlate with each other in
reverse, so in comparing different scenarios it doesn&#8217;t matter which one we use: if \(P(A|B)\) is
lower in one scenario than in another, the probability of doing worse the second time will be higher
and vice&nbsp;versa.)
</p>
</div>

<div id="outline-container-orgd639c34" class="outline-3">
<h3 id="orgd639c34"><span class="dquo">&#8220;</span>Sophomore Slump&#8221;: <span class="caps">NBA</span> Rookie&nbsp;Seasons</h3>
</div>
</div>
